Revit 2027 API
ExporterIFC.SetCurrentExportedDocument Method
 Sets the exporter to process a particular document during export.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCurrentExportedDocument(
	Document pDocument
)
Public Sub SetCurrentExportedDocument (
	pDocument As Document
)
public:
void SetCurrentExportedDocument(
	Document^ pDocument
)
member SetCurrentExportedDocument :
        pDocument : Document -> unit
Parameters
pDocument Document
 The document being processed.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This is intended for use in federated export.
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace